app/Http/Controllers/API/ApiPackageController.php

    public function all()
    {
        return new PackageCollection(Package::get());
---
select * from `packages`