app/Http/Controllers/Api/ApiPackageController.php

    public function index()
    {
        $packages = Package::all();
---
select * from `packages`