app/Http/Controllers/Api/ContactAPIController.php

    public function store(Request $request)
    {
        $validation = Validator::make(
            $request->all(),
            $this->ruleValidates()
        );
        if ($validation->fails()) {
            $response = array('status' => 'error', 'errors' => $validation->errors()->toArray());
            return response()->json($response);
        }

        $user = new User();
        $user->name = $request->name;
        $user->phone = $request->phone;
        $user->email = $request->email;
        $user->save();

        $contact = new Contact();
        $contact->user_id = $user->id;
        $contact->save();
---
insert into `users` (`name`, `phone`, `email`, `updated_at`, `created_at`) values ('àádfsdf s', '0917459472', 'hieu.tran23@student.passerellesnumeriques.org', '2022-08-03 15:23:30', '2022-08-03 15:23:30')
insert into `contacts` (`user_id`, `updated_at`, `created_at`) values (302, '2022-08-03 15:23:30', '2022-08-03 15:23:30')