app/Http/Controllers/API/SearchAPIController.php

    public function search(Request $request) //request cua get: cateId
    {
        $posts = Post::join('categories', 'categories.id', 'posts.category_id')
        ->select('categories.name as nameCategory', 'posts.*');

        if ($request->cateId) {
            $posts = $posts->where("category_id", $request->cateId);
        }
        if ($request->title) {
            $posts = $posts->where("title", "LIKE", "%".$request->title."%");
        }

        $posts = $posts->paginate(10);
---
select `categories`.`name` as `nameCategory`, `posts`.* from `posts` inner join `categories` on `categories`.`id` = `posts`.`category_id` where `title` LIKE '%Ca%' limit 10 offset 0
select count(*) as aggregate from `posts` inner join `categories` on `categories`.`id` = `posts`.`category_id` where `title` LIKE '%Ca%'

    public function statistical()
    {
        $count_category = Category::leftJoin('posts',  'posts.category_id', 'categories.id')
            ->selectRaw('categories.name, categories.id,  count(posts.category_id) as total')
            ->groupBy('categories.name', 'categories.id', 'posts.category_id')
            ->paginate(10);
---
select categories.name, categories.id,  count(posts.category_id) as total from `categories` left join `posts` on `posts`.`category_id` = `categories`.`id` group by `categories`.`name`, `categories`.`id`, `posts`.`category_id` limit 10 offset 0